W7D3/Music_App_Specs/app/models/user.rb

INSERT INTO "users" ("email", "password_digest", "session_token", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"
UPDATE "users" SET "session_token" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["session_token", "0KXzD1_rVfCsaDhnYUxJ-w"], ["updated_at", "2021-02-09 18:02:19.114749"], ["id", 2]]
---
    def reset_session_token!
        self.session_token = User.generate_session_token
        self.save!